Revit 2026 API

# MetallicPaintMetallicpaintBaseColorByObject Property

---

The property labeled "Color By Object" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintBaseColorByObject { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintBaseColorByObject As String
	Get
```
```cpp
public:
static property String^ MetallicpaintBaseColorByObject {
	String^ get ();
}
```
```fsharp
static member MetallicpaintBaseColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace